## Day 3 -- Missing Value & Data Validation

Fokus: Missing Value & Data Validation

Dataset: customer_dirty.csv

### Audit Missing Value
- Task : Hitung jumlah & persentase missing per kolom

In [3]:
import pandas as pd 

df = pd.read_csv('/Users/axzolotle/Code/self-learn/learning-intern/dataset/Customer_dirty_data_task3.csv')
df.head()

,customer_id,name,age,gender,employment_status,income,city,signup_date
0,1,Andi,25.0,Male,employed,5000000.0,Jakarta,2023-01-10
1,2,Siti,NaN,Female,unemployed,NaN,Bandung,2023-02-12
2,3,Budi,17.0,Male,employed,3000000.0,Jakarta,2023-01-20
3,4,Ani,45.0,female,employed,12000000.0,Surabaya,2022-11-05
4,5,Dedi,70.0,Male,retired,1500000.0,Medan,2021-06-17

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        10 non-null     int64
 1   name               10 non-null     object
 2   age                8 non-null      float64
 3   gender             9 non-null      object
 4   employment_status  10 non-null     object
 5   income             9 non-null      float64
 6   city               10 non-null     object
 7   signup_date        10 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 772.0+ bytes

In [5]:
df.income.isnull().any()

np.True_

### Handle Missing (Logic-based)
Contoh logic (boleh kamu modif):

income missing + employment_status = unemployed → 0

gender missing → "unknown"

age missing → biarkan dulu

In [7]:
def fill_null(df):
    mask = (df['employment_status'] == 'unemployed') & (df['income'].isnull())
    df.loc[mask, 'income'] = 0
    df['gender'] = df['gender'].fillna('unknown')
    return df

In [8]:
data_filled = fill_null(df)
data_filled

,customer_id,name,age,gender,employment_status,income,city,signup_date
0,1,Andi,25.0,Male,employed,5000000.0,Jakarta,2023-01-10
1,2,Siti,NaN,Female,unemployed,0.0,Bandung,2023-02-12
2,3,Budi,17.0,Male,employed,3000000.0,Jakarta,2023-01-20
3,4,Ani,45.0,female,employed,12000000.0,Surabaya,2022-11-05
4,5,Dedi,70.0,Male,retired,1500000.0,Medan,2021-06-17
5,6,Rina,30.0,unknown,employed,-4000000.0,Jakarta,2023-03-01
6,7,Tono,200.0,Male,employed,7000000.0,Bekasi,2023-02-28
7,8,Lina,22.0,FEMALE,student,0.0,Depok,2023-01-15
8,9,Hadi,65.0,Male,employed,1800000.0,Semarang,2022-12-01
9,10,Maya,NaN,Female,employed,9000000.0,Jakarta,2023-03-10

### Data Validation

Cari data:

age < 0 atau age > 100

income < 0

age < 18 tapi employment_status = employed

In [29]:
def check_validation(df):
    valid_data = df[
        ((df['age'] < 0) | (df['age'] > 100)) &
        (df['income'] < 0) &
        ((df['age'] < 18) & (df['employment_status'] == 'employed'))
    ]
    if valid_data.empty:
        print("All data is valid")
    else:
        print("There are invalid data entries")
    return valid_data

In [30]:
df_validation = check_validation(df)
df_validation

All data is valid

Empty DataFrame
Columns: [customer_id, name, age, gender, employment_status, income, city, signup_date]
Index: []